{
  "Activity": {
    "commute": {
      "positive": [
        "Use calm breathing during your ride. (APA Mindfulness; NHS)",
        "Play upbeat music or a good podcast. (Mayo Clinic; APA)",
        "Walk part of your route if possible. (CDC Physical Activity)",
        "Record a quick gratitude note. (Greater Good; APA)",
        "Plan your route with buffer time. (DOT Travel Tips; APA)",
        "Use noise-reducing headphones in crowds. (WHO Noise; NIOSH)"
      ],
      "negative": [
        "Try box breathing (4–4–4–4). (APA Anxiety; NHS)",
        "Leave 10–15 minutes early to avoid rushing. (DOT; APA)",
        "Check traffic or transit alerts first. (DOT Travel Tips)",
        "Take a short stretch break if stressed. (CDC Workplace Health)",
        "Use calm playlists and limit heavy news. (APA Media; WHO)",
        "Try carpooling or biking when you can. (CDC Physical Activity; WHO)"
      ]
    },
    "exam": {
      "positive": [
        "Study in small chunks over days. (APA Learning; NHS)",
        "Quiz yourself to practice recall. (APA Learning)",
        "Sleep well the night before. (Sleep Foundation; NIH)",
        "Do 3–5 minutes of calm breathing before. (NHS; APA)",
        "Pack a simple checklist (ID, pens, water). (APA Study Skills)",
        "Do quick review and kind self-talk. (APA CBT)"
      ],
      "negative": [
        "Switch to active study (teach it, practice). (APA Learning)",
        "Use Pomodoro (25 focus, 5 break). (APA Study Skills)",
        "Write a short test-stress plan. (NHS; APA)",
        "Aim for 7–9 hours of sleep. (Sleep Foundation; NIH)",
        "Eat balanced and hydrate. (CDC Nutrition)",
        "Ask questions early if stuck. (CDC Education; APA)"
      ]
    },
    "homework": {
      "positive": [
        "Set small, clear goals for each session. (APA Goal Setting)",
        "Use a tidy, dedicated workspace. (APA Environment)",
        "Reward tasks with short breaks. (APA Habits)",
        "Do homework at a regular time. (APA Routine)",
        "Batch similar tasks together. (APA Productivity)",
        "Track progress with a checklist. (APA Self-Efficacy)"
      ],
      "negative": [
        "Break big tasks into tiny steps. (APA Goal Setting)",
        "Timebox a tough start (15–25 min). (APA Productivity)",
        "Put phone on Do Not Disturb. (APA Attention)",
        "Ask for help from peers or teachers. (CDC Education; APA)",
        "Mix hard and easy tasks. (APA Cognitive Load)",
        "Use self-compassion when behind. (APA Self-Compassion)"
      ]
    },
    "study": {
      "positive": [
        "Use spaced repetition and self-testing. (APA Learning; Dunlosky)",
        "Mix topics to stay fresh. (APA Learning)",
        "Teach someone else to find gaps. (APA Learning)",
        "Take short movement breaks. (CDC Physical Activity)",
        "Sleep 7–9 hours for memory. (Sleep Foundation; NIH)",
        "Use words plus visuals for tough topics. (APA Dual Coding)"
      ],
      "negative": [
        "Swap rereading for practice problems. (APA Learning)",
        "Use shorter, focused blocks. (APA Study Skills)",
        "Change study spots sometimes. (APA Environment)",
        "Make a quick plan before starting. (APA Goal Setting)",
        "Use positive self-talk on hard topics. (APA CBT)",
        "Ask instructors for examples. (CDC Education)"
      ]
    },
    "project": {
      "positive": [
        "Make a simple plan with milestones. (PMI Basics)",
        "Celebrate small wins as you go. (APA Positive Psych)",
        "Use shared tools and clear roles. (APA Teams)",
        "Protect deep work time. (APA Productivity)",
        "Check for risks weekly. (PMI Risk)",
        "Reflect after milestones to improve. (APA Metacognition)"
      ],
      "negative": [
        "Break work into tasks with owners and dates. (PMI Planning)",
        "Start with an easy 15-minute task. (APA Activation)",
        "Ask for help or delegate when possible. (APA Teams)",
        "Use a checklist or Kanban board. (PMI; Lean)",
        "Add buffer time for surprises. (PMI Planning)",
        "Keep scope clear and avoid overcommitment. (PMI Scope)"
      ]
    },
    "read": {
      "positive": [
        "Read in a quiet, comfy spot. (APA Environment)",
        "Add notes or short summaries. (APA Learning)",
        "Read a little before bed to wind down. (Sleep Foundation)",
        "Join a book club or share picks. (APA Social Support)",
        "Alternate genres to keep interest high. (APA Motivation)",
        "Do short reading sprints, then reflect. (APA Metacognition)"
      ],
      "negative": [
        "Switch genre or try audio if stuck. (APA Accessibility)",
        "Set a small reading goal (10–15 min). (APA Goals)",
        "Pick uplifting or fun material. (APA Media)",
        "Use eye breaks (20-20-20). (Optometry)",
        "Read earlier in the evening. (Sleep Foundation)",
        "Pair reading with a cozy routine. (APA Habits)"
      ]
    },
    "extracurricular": {
      "positive": [
        "Pick activities that match your interests. (APA Strengths)",
        "Keep a balanced schedule. (APA Stress)",
        "Set simple goals and review progress. (APA Goals)",
        "Connect with others; build friendships. (CDC Social Health)",
        "Rotate activities to keep them fresh. (APA Motivation)",
        "Track time so school doesn’t get crowded out. (APA Time Management)"
      ],
      "negative": [
        "Prioritize activities that energize you. (APA Motivation)",
        "Cut back a bit if overloaded. (APA Stress)",
        "Add short breaks between events. (NIOSH Fatigue)",
        "Share limits clearly with organizers. (APA Assertiveness)",
        "Find a mentor for tips and support. (CDC Youth Development)",
        "Choose low-effort, meaningful options when tired. (APA Activation)"
      ]
    },
    "household-chores": {
      "positive": [
        "Play energizing music and set a timer. (APA Activation)",
        "Batch chores to reduce switching. (APA Productivity)",
        "Use a simple checklist for wins. (APA Goals)",
        "Add light movement while you clean. (CDC Physical Activity)",
        "Do chores together for support. (CDC Social Health)",
        "Reward yourself with a short break. (APA Habits)"
      ],
      "negative": [
        "Start with tiny tasks to build momentum. (APA Activation)",
        "Timebox chores (10–15 min). (APA Productivity)",
        "Declutter one small area first. (APA Environment)",
        "Put phone away during short bursts. (APA Attention)",
        "Make a weekly chore plan. (APA Routine)",
        "Aim for progress, not perfection. (APA Self-Compassion)"
      ]
    },
    "relax": {
      "positive": [
        "Try guided breathing or a body scan. (NHS Mindfulness; APA)",
        "Take regular micro-breaks. (NIOSH Fatigue)",
        "Add gentle stretching. (NIH Physical Activity)",
        "Journal your thoughts for a few minutes. (APA Writing)",
        "Use muscle relaxation to release tension. (APA PMR)",
        "Protect your chill time on your calendar. (APA Boundaries)"
      ],
      "negative": [
        "Try a short beginner meditation. (NHS; APA)",
        "Do a 5-minute breath focus. (APA Anxiety Tools)",
        "Give yourself permission to rest. (APA Self-Compassion)",
        "Switch to a relaxing hobby you enjoy. (APA Activation)",
        "Lower screen time before relaxing. (Sleep Foundation; WHO)",
        "Create a simple evening wind-down routine. (Sleep Foundation)"
      ]
    },
    "watch-movie": {
      "positive": [
        "Pick light or funny content. (APA Media)",
        "Watch with friends or family. (CDC Social Health)",
        "Start earlier to avoid late stimulation. (Sleep Foundation)",
        "Take short stretch breaks. (NIH Physical Activity)",
        "Reflect briefly on what you liked. (APA Metacognition)",
        "Keep a watchlist that fits your mood. (APA Positive Psych)"
      ],
      "negative": [
        "Switch to lighter content if you feel down. (APA Media)",
        "Limit screens before bedtime. (Sleep Foundation)",
        "Take breaks to rest eyes and move. (CDC; Optometry)",
        "Avoid heavy news right before or after. (APA Media; WHO)",
        "Watch with someone supportive. (CDC Social Health)",
        "Use night mode in the evening. (Sleep Foundation)"
      ]
    },
    "listen-music": {
      "positive": [
        "Make playlists for different moods. (APA Music Therapy)",
        "Use calm tracks for study or wind-down. (APA; Sleep Foundation)",
        "Try new genres for fun. (APA Motivation)",
        "Combine music with a walk. (CDC Physical Activity)",
        "Use lyric-free tracks when you need focus. (APA Attention)",
        "Share music with friends. (CDC Social Health)"
      ],
      "negative": [
        "Pick calming playlists and slower tempos. (APA Music Therapy)",
        "Limit intense or negative lyrics when low. (APA Media)",
        "Try instrumental or nature sounds. (NHS Relaxation)",
        "Do short, intentional listening sessions. (APA Mindfulness)",
        "Pair music with belly breathing. (APA Anxiety Tools)",
        "Track your mood to guide choices. (APA Self-Monitoring)"
      ]
    },
    "gaming": {
      "positive": [
        "Choose creative or co-op modes. (APA Media; SDT)",
        "Set clear time limits. (NIH Screen Time; APA)",
        "Play with supportive friends. (CDC Social Health)",
        "Match the game to your energy level. (APA Motivation)",
        "Take movement and eye breaks. (NIH; CDC)",
        "Notice your progress and wins. (APA Positive Psych)"
      ],
      "negative": [
        "Switch to low-stress games when down. (APA Media)",
        "Limit competitive modes for now. (WHO Gaming Balance)",
        "Use timers for shorter sessions. (APA Productivity)",
        "Alternate with offline relaxing activities. (APA Activation)",
        "Mute toxic chats; curate spaces. (APA Cyberpsychology)",
        "If mood drops often, reduce playtime and check in. (APA Self-Monitoring)"
      ]
    },
    "browse-internet": {
      "positive": [
        "Decide your goal before browsing. (APA Goal Setting)",
        "Follow quality sources. (WHO Media Literacy; CDC)",
        "Use set browsing windows. (APA Time Management)",
        "Track or limit time if needed. (APA Habits)",
        "Take quick breaks to reset. (NIOSH Fatigue)",
        "Curate feeds with uplifting content. (APA Media)"
      ],
      "negative": [
        "Cut doom-scrolling; limit news when low. (APA; WHO)",
        "Take 5–10 minute offline breaks. (NIOSH Fatigue)",
        "Unfollow sources that hurt mood. (APA Cyberpsychology)",
        "Do a short grounding after heavy content. (APA Mindfulness)",
        "Switch to offline hobbies. (APA Activation)",
        "Set a screen cutoff before bed. (Sleep Foundation)"
      ]
    },
    "shopping": {
      "positive": [
        "Make a list and a simple budget. (APA Decision Making)",
        "Go with a supportive friend or family member. (CDC Social Health)",
        "Shop at off-peak times. (APA Environment)",
        "Treat yourself within limits. (APA Self-Regulation)",
        "Plan essentials ahead of time. (APA Time Management)",
        "Pause and think before buying. (APA Mindfulness)"
      ],
      "negative": [
        "Stick to your budget and list. (APA Financial Well-being)",
        "Avoid crowds if you feel stressed. (APA Environment)",
        "Take breaks and hydrate. (CDC)",
        "If mood dips, window-shop or postpone. (APA Self-Regulation)",
        "Use cash or set spending caps. (APA Behavioral Economics)",
        "Play calming music and slow your pace. (APA Mindfulness)"
      ]
    },
    "travel": {
      "positive": [
        "Plan ahead and add buffer time. (PMI Planning; APA)",
        "Pack water, snacks, and small comforts. (CDC Travel Health)",
        "Move a little during long trips. (NIH; CDC)",
        "Write down trip highlights. (APA Positive Psych)",
        "Use calm breathing in crowds. (APA Anxiety Tools)",
        "Keep a simple sleep routine on trips. (Sleep Foundation)"
      ],
      "negative": [
        "Have a backup plan for delays. (PMI Risk)",
        "Hydrate, stretch, and pace yourself. (CDC; NIH)",
        "Lower noise and light if tired. (WHO; Sleep Foundation)",
        "Do short mindfulness in transit. (NHS; APA)",
        "Travel with supportive company if you can. (CDC Social Health)",
        "Limit heavy content when stressed. (APA Media)"
      ]
    }
  },
  "Social": {
    "alone": {
      "positive": [
        "Use alone time for calm activities. (APA; WHO Mental Health)",
        "Try short mindfulness or breathing. (NHS; APA)",
        "Journal quick reflections or goals. (APA Writing)",
        "Do a small creative project. (APA Creativity)",
        "Set boundaries to protect recharge time. (APA Boundaries)",
        "Balance alone time with some social contact. (CDC Social Health)"
      ],
      "negative": [
        "Message a friend or join a group. (CDC Social Health)",
        "Try a small volunteer activity. (Mayo Clinic; APA)",
        "Go outside for a short walk. (NIH Physical Activity)",
        "Use a guided meditation to steady emotions. (NHS; APA)",
        "Plan one small social plan each week. (APA Activation)",
        "Reach out for support if loneliness persists. (APA Mental Health)"
      ]
    },
    "friends": {
      "positive": [
        "Plan regular check-ins or hangouts. (APA Social Support)",
        "Share appreciation and kind feedback. (APA Positive Psych)",
        "Play cooperative games or activities. (APA Groups)",
        "Use active listening. (APA Communication)",
        "Mix online and in-person time. (CDC Social Health)",
        "Protect friendship time on your calendar. (APA Boundaries)"
      ],
      "negative": [
        "Talk through misunderstandings calmly. (APA Communication)",
        "Invite a friend for a simple activity. (CDC Social Health)",
        "Join clubs or classes to expand your circle. (CDC Youth)",
        "Practice empathy and perspective-taking. (APA Social Psych)",
        "Set healthy boundaries. (WHO Mental Health; APA)",
        "Seek support if conflicts repeat. (APA Counseling)"
      ]
    },
    "family": {
      "positive": [
        "Plan shared meals or activities. (CDC Family Health)",
        "Say thank you and appreciate small things. (APA Positive Psych)",
        "Use calm talk during disagreements. (APA Communication)",
        "Balance family time with personal space. (APA Boundaries)",
        "Create small traditions. (APA Family Studies)",
        "Solve household problems together. (APA Problem Solving)"
      ],
      "negative": [
        "Take short breaks if tension rises. (APA Anger Management)",
        "Set clear boundaries and expectations. (WHO; APA)",
        "Try mediation or counseling if needed. (APA Family Therapy)",
        "Discuss behaviors, not personal attacks. (APA Communication)",
        "Plan short, positive time to rebuild trust. (APA Relationship Repair)",
        "Do neutral activities to reset. (CDC; APA)"
      ]
    },
    "classmates": {
      "positive": [
        "Set clear goals and roles for group work. (APA Group Dynamics)",
        "Share study tips and resources. (APA Learning; CDC)",
        "Rotate tasks to learn new skills. (APA Education)",
        "Give respectful feedback and listen well. (APA Communication)",
        "Celebrate wins after submissions. (APA Positive Psych)",
        "Build study buddies for support. (CDC Social Health)"
      ],
      "negative": [
        "Set expectations early for fair work. (APA Group Dynamics)",
        "Speak up kindly if something’s off. (APA Communication)",
        "Ask teachers for guidance when stuck. (CDC Education; APA)",
        "Write task agreements to stay clear. (PMI Basics)",
        "Do brief check-ins to avoid last-minute rush. (APA Time Management)",
        "Keep focus on shared goals. (APA Group Process)"
      ]
    },
    "relationship": {
      "positive": [
        "Listen actively and show empathy. (APA Couples)",
        "Plan quality time and shared activities. (APA Relationships)",
        "Express appreciation with small acts. (APA Positive Psych)",
        "Talk openly about needs and boundaries. (APA Communication)",
        "Use gentle repair after conflict. (Gottman; APA)",
        "Balance closeness and personal space. (APA Attachment)"
      ],
      "negative": [
        "Use calm, kind language in conflict. (APA Communication)",
        "Take short breaks if things heat up. (APA Anger Management)",
        "Seek counseling if patterns persist. (NHS; APA)",
        "Clarify expectations and find compromises. (APA Relationships)",
        "Start conversations gently, not harshly. (Gottman; APA)",
        "Focus on actions, not labels. (APA Communication)"
      ]
    },
    "online": {
      "positive": [
        "Choose platforms that feel supportive. (APA Cyberpsychology)",
        "Set time limits and stick to them. (APA Habits)",
        "Share and follow uplifting content. (APA Media)",
        "Use privacy tools to stay safe. (CDC Online Safety)",
        "Mix online time with offline breaks. (NIOSH Fatigue)",
        "Check in with friends kindly. (CDC Social Health)"
      ],
      "negative": [
        "Mute or block toxic accounts. (APA Cyberpsychology)",
        "Limit late-night scrolling. (Sleep Foundation)",
        "Avoid heated threads when stressed. (APA Emotion Regulation)",
        "Do a short breathing break after heavy content. (APA Mindfulness)",
        "Switch to offline activities to reset. (APA Activation)",
        "Seek help if online stress persists. (APA Mental Health)"
      ]
    },
    "pet": {
      "positive": [
        "Play regularly to boost mood. (CDC; APA Anthrozoology)",
        "Use simple training for engagement. (APA Behavior)",
        "Keep a routine for care. (CDC; WHO)",
        "Go outside together for sunlight and movement. (NIH; CDC)",
        "Share pet moments with friends or family. (CDC Social Health)",
        "Track care tasks to stay consistent. (APA Habits)"
      ],
      "negative": [
        "Simplify routines on low-energy days. (APA Self-Regulation)",
        "Ask family or friends for help. (CDC Social Health)",
        "Do short play or gentle walks. (NIH Physical Activity)",
        "Use calm, quiet spaces to reduce stress. (NIOSH; APA)",
        "Join supportive pet communities. (APA Cyberpsychology)",
        "Ask a vet or trainer for guidance when needed. (CDC)"
      ]
    }
  },
  "Health": {
    "jog": {
      "positive": [
        "Increase distance slowly over time. (ACSM; CDC)",
        "Warm up and cool down each session. (ACSM; NIH)",
        "Track your runs to see progress. (APA Habits)",
        "Hydrate and fuel simply. (CDC Nutrition)",
        "Pick routes you enjoy. (APA Environment)",
        "Match music to your pace. (APA Performance)"
      ],
      "negative": [
        "Switch to brisk walking when tired. (CDC; WHO)",
        "Set small goals to rebuild consistency. (APA Goals)",
        "Check shoes and running surface. (ACSM; NIH)",
        "Add light stretching or mobility. (NIH; ACSM)",
        "Track mood and energy to adjust. (APA Self-Monitoring)",
        "See a pro if pain sticks around. (CDC Clinical)"
      ]
    },
    "walk": {
      "positive": [
        "Aim for regular weekly walking time. (CDC)",
        "Try nature walks for a mood lift. (NIH; APA)",
        "Walk with a friend for support. (CDC Social Health)",
        "Use fast/slow intervals for variety. (ACSM; CDC)",
        "Wear comfy shoes and hydrate. (NIH; ACSM)",
        "Track steps for motivation. (APA Habits)"
      ],
      "negative": [
        "Do shorter, more frequent walks. (CDC)",
        "Explore new routes. (APA Motivation)",
        "Pair walking with uplifting audio. (APA Media)",
        "Walk at a regular time each day. (APA Routine)",
        "Do gentle stretches after if stiff. (NIH; ACSM)",
        "Use indoor options if needed. (CDC)"
      ]
    },
    "exercise": {
      "positive": [
        "Mix cardio, strength, and stretching. (CDC; ACSM)",
        "Progress slowly and track workouts. (ACSM; APA)",
        "Use a buddy or class for motivation. (CDC Social Health)",
        "Eat and hydrate to support workouts. (CDC Nutrition)",
        "Rest well and sleep enough. (Sleep Foundation; NIH)",
        "Celebrate small milestones. (APA Positive Psych)"
      ],
      "negative": [
        "Start with short, easy sessions. (CDC; ACSM)",
        "Pick activities you enjoy. (APA Motivation)",
        "Plan sessions with a simple checklist. (APA Time Management)",
        "Be kind if you miss a day; restart gently. (APA Self-Compassion)",
        "Do mobility or stretching on off days. (ACSM; NIH)",
        "Ask a pro if pain or barriers persist. (CDC Clinical)"
      ]
    },
    "sports": {
      "positive": [
        "Focus on learning and teamwork. (APA Sport Psych)",
        "Warm up, cool down, and hydrate. (ACSM; CDC)",
        "Use positive self-talk. (APA Performance)",
        "Set simple skill goals. (APA Goals)",
        "Balance training with rest. (NIH; ACSM)",
        "Build a supportive team vibe. (APA Groups)"
      ],
      "negative": [
        "Reframe pressure; ask coach for tips. (APA Sport Psych)",
        "Use stress tools before games. (APA Anxiety Tools)",
        "Cross-train or lower intensity when tired. (ACSM; CDC)",
        "Handle conflicts with calm talk. (APA Communication)",
        "Prioritize recovery for stable mood. (Sleep Foundation)",
        "Get support for performance anxiety if needed. (APA Counseling)"
      ]
    },
    "meditate": {
      "positive": [
        "Practice 5–10 minutes daily. (NHS; APA)",
        "Try different styles to see what fits. (APA Mindfulness)",
        "Use guided sessions to stay on track. (NHS; APA)",
        "Stretch lightly before or after. (NIH Physical Activity)",
        "Keep a patient, non-judgmental mindset. (APA Mindfulness)",
        "Note mood changes to guide practice. (APA Self-Monitoring)"
      ],
      "negative": [
        "Start super short (2–3 minutes). (APA Habits)",
        "Use beginner-friendly apps. (NHS; APA)",
        "Switch to calming activities if needed. (APA Activation)",
        "Practice simple breathing during daily tasks. (APA Anxiety Tools)",
        "Avoid self-criticism; progress is gradual. (APA Self-Compassion)",
        "Seek help if distress grows. (NHS; APA)"
      ]
    },
    "eat-healthy": {
      "positive": [
        "Balance your plate with fruits, grains, and protein. (CDC; WHO)",
        "Plan quick meals ahead. (APA Time Management)",
        "Drink water more often. (CDC Nutrition)",
        "Add fiber for steady energy. (NIH; CDC)",
        "Try simple healthy recipes. (Mayo Clinic)",
        "Eat mindfully and enjoy your food. (APA Mindful Eating)"
      ],
      "negative": [
        "Make small swaps (water for soda). (CDC; WHO)",
        "Prep easy healthy snacks. (CDC; NIH)",
        "Limit ultra-processed foods. (WHO; CDC)",
        "Keep regular meal times. (Sleep Foundation; NIH)",
        "Use smaller portions and slow down. (APA Mindful Eating)",
        "Ask a dietitian for help if needed. (CDC Clinical)"
      ]
    },
    "eat-unhealthy": {
      "positive": [
        "Balance treats with healthy meals; avoid all-or-nothing thinking. (APA Self-Regulation; CDC)",
        "Practice portion control to enjoy without overdoing. (WHO; CDC)",
        "Pair treats with protein or fiber to stabilize energy. (NIH; CDC)",
        "Schedule treat windows to reduce impulsive snacking. (Behavioral Economics; APA)",
        "Savor slowly to increase satisfaction. (APA Mindful Eating)",
        "Offset with hydration and light activity later. (CDC; WHO)"
      ],
      "negative": [
        "Plan meals to avoid last-minute choices. (CDC; APA)",
        "Swap a few items for healthier options. (WHO; CDC)",
        "Keep tempting foods out of reach. (APA Behavioral)",
        "Use mindful eating to notice fullness. (APA; NIH)",
        "Drink water and add fruits or veggies. (CDC; WHO)",
        "Ask for nutrition help if patterns persist. (CDC Clinical)"
      ]
    },
    "no-physical": {
      "positive": [
        "Use rest days for recovery. (ACSM; NIH)",
        "Do light stretching or calm breathing. (APA; CDC)",
        "Pick relaxing hobbies to recharge. (APA Positive Psych)",
        "Step outside briefly for sunlight. (NIH; APA)",
        "Plan your next activity day. (APA Goal Setting)",
        "Keep hydration and sleep steady. (Sleep Foundation; CDC)"
      ],
      "negative": [
        "Start with very light movement (5–10 min). (CDC; ACSM)",
        "Set small activity goals. (APA Goals)",
        "Use reminders to move briefly each hour. (NIOSH; APA)",
        "Pair movement with music. (APA Activation)",
        "Track tiny wins to stay motivated. (APA Self-Monitoring)",
        "Get help if barriers keep you stuck. (CDC Clinical)"
      ]
    },
    "drink-alcohol": {
      "positive": [
        "If you choose to drink, set a low limit and pace yourself. (CDC Alcohol; WHO)",
        "Eat before and hydrate during. (CDC Nutrition)",
        "Alternate alcoholic and non-alcoholic drinks. (CDC Alcohol)",
        "Avoid drinking when stressed or sleep-deprived. (APA Self-Regulation; Sleep Foundation)",
        "Plan safe transport and a cutoff time. (CDC Safety)",
        "If unsure, choose not to drink. (WHO; CDC)"
      ],
      "negative": [
        "Skip alcohol today and choose a relaxing activity. (WHO; APA)",
        "If drinking patterns worry you, talk to a professional. (CDC Clinical; WHO)",
        "Set a screen or social cutoff to avoid pressure. (APA Boundaries)",
        "Hydrate and get good sleep to recover. (CDC; Sleep Foundation)",
        "Use a support buddy for social events. (CDC Social Health)",
        "Learn low-risk guidelines for your region. (WHO; CDC)"
      ]
    }
  },
  "Sleep": {
    "less": [
      "Aim for 7–9 hours with a steady schedule. (Sleep Foundation; NIH)",
      "Create a simple wind-down routine. (Sleep Foundation; NHS)",
      "Limit caffeine later in the day. (NIH; WHO)",
      "Cut screens an hour before bed. (Sleep Foundation)",
      "Keep your room cool, dark, and quiet. (Sleep Foundation; WHO)",
      "Get morning light to set your body clock. (NIH)"
    ],
    "enough": [
      "Protect your usual sleep window. (Sleep Foundation)",
      "Keep timing steady, even on weekends. (Sleep Foundation; APA)",
      "Try light stretching or calm breathing before bed. (APA; NIH)",
      "Avoid heavy meals or late intense workouts. (NIH; Sleep Foundation)",
      "Adjust noise and light for better sleep. (Sleep Foundation; WHO)",
      "Balance activity and rest during the day. (CDC)"
    ],
    "more": [
      "Set a consistent wake-up time and morning plan. (Sleep Foundation)",
      "Get more daylight and movement. (CDC; NIH)",
      "Check stress and schedule; adjust if needed. (APA)",
      "Limit naps; keep them short and earlier. (Sleep Foundation)",
      "Talk to a provider if oversleeping persists. (NIH; CDC Clinical)",
      "Shift bedtime and wake time gradually. (Sleep Foundation)"
    ]
  }
}